ttkpark/safelink/firmware_test/test_sensor_am2320_heartbeat/sdkconfig.defaults
# ESP-PICO Sensor Test Configuration (AM2320 + Heartbeat)

# Target Configuration
CONFIG_IDF_TARGET="esp32c6"

# I2C Configuration for AM2320
CONFIG_I2C_ENABLE_DEBUG_LOG=y
CONFIG_I2C_MASTER_TIMEOUT_MS=1000

# ADC Configuration for Heartbeat Sensor
CONFIG_ADC_DISABLE_DAC=y
CONFIG_ADC_CAL_EFUSE_TP_ENABLE=y
CONFIG_ADC_CAL_EFUSE_VREF_ENABLE=y
CONFIG_ADC_CAL_LUT_ENABLE=y

# FreeRTOS Configuration
CONFIG_FREERTOS_HZ=1000

# Log Configuration
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y

# Main task stack size
CONFIG_MAIN_TASK_STACK_SIZE=8192

# Serial flasher config
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# UART Configuration
CONFIG_ESP_CONSOLE_UART_NUM=0
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

# Bluetooth Configuration
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_BLE_ENABLED=n
CONFIG_BT_CLASSIC_ENABLED=y
CONFIG_BT_CONTROLLER_ENABLED=y
CONFIG_BT_CONTROLLER_ONLY=n
CONFIG_BT_SPP_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=n 